In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = {
    'name' : ['a', 'b', 'c', 'd'],
    'roll' : [10, 20, 30, 40],
}
df2 = pd.DataFrame(df1)
df2

  name  roll
0    a    10
1    b    20
2    c    30
3    d    40

In [3]:
df3 = {
    'names' : ['aa', 'bb', 'cc', 'dd'],
    'roll_no' : [100, 200, 300, 400],
}
df4 = pd.DataFrame(df3)
df4

  names  roll_no
0    aa      100
1    bb      200
2    cc      300
3    dd      400

In [8]:
df2.join(df4)

  name  roll names  roll_no
0    a    10    aa      100
1    b    20    bb      200
2    c    30    cc      300
3    d    40    dd      400